{"id": "n91JLtZjb0zX0FT7ZHT122d8yz8tquqN", "post_id": "auckbi", "post_type": "AITA", "title": "AITA for insulting my religious Dad?", "text": "I (17m) recently had a big fight with Dad about him forcing his religion on the entire family. I have been atheist for almost 2 years now, but I kept it a secret because both my parents are very religious. It wasn't a problem until recently when I started working part time (also a HS student).\n\nBefore I started working, I simply went to Mass since I would have the whole day to rest, go out in the afternoon, and get my schoolwork done. Now, I work weekend afternoons (I start at around 2) and mornings is when I get my schoolwork and volunteering done. I really cannot afford to lose 2 hours of my morning time, it really sets me back.\n\nI tried to tell them respectfully that I did not wish to attend Mass anymore, but they would not listen and still force me to go. I tried so many time, every Sunday for 2 months, that they have he right to believe what they want, but so do I. But nothing worked :(\n\nAnd then came this morning. I have a lot of schoolwork at the moment and I'm applying to this summer program across the country, so I have spent a lot of time on my application. I've been in the zone typing my essay for about an hour when my Dad walks into my room and tells me to get ready for Mass in 10 minutes. I tell him I don't want to go, he tells me he's not asking blah blah blah just like every Sunday. Finally he shouts at me (for the first time in our arguments, they had been somewhat civil in the past) and tells me he\"ll throw away my new computer, which I bought, with my money.\n\nI say nothing and don't move, he reaches for my laptop and I just snap. I move my computer away and just start screaming that I'm done with his BS and I how I really feel, that I haven't prayed once in 2 years and I just lose it. I then took my anger out on his beliefs. I point out the flaws, hypocrisy in the church, the molestation problem, the nonsense and homophobia and blah blah blah.\n\nLater he comes and tells me he's expects me to apologize to him or he'll take away all my electronics and that tomorrow he's taking me to confession to \"apologize\" to God.\n\nSo AITA for what I said? Did I take things too far? Should I apologize?", "label_scores": {"YTA": 5, "NTA": 22, "ESH": 7, "NAH": 0, "INFO": 0}, "label": "NTA"}
{"id": "mfgkRRLrxydUiIpWH3IKjAHR0IzGdFMe", "post_id": "aqf2sf", "post_type": "AITA", "title": "AITA - Friend being Secretive", "text": "Hello everyone! This is my first post to this sub-reddit, actually first post to reddit ever (excluding dumb stuff), so go easy on me.\n\n&amp;#x200B;\n\nAnyway, so I have this good friend who we'll call Candice. So Candice and I essentially talk all the time in Bio class, when we pass by each other we always say hi or start up a conversation, used to text all day on the phone, and she's pretty cool! (also, no feelings for Candice, she actually has a boyfriend so we're just good friends). So one random day, Candice stayed after Bio class with two other people, so I naturally asked what they were doing. Although, she said they were doing something that I couldn't know about, well actually she said I can know about in September. I thought she was joking, but she was actually serious and really doesn't want me, or apparently anyone for that matter (other than the two people she's working with) to know about it. About the two people Candice is working with, one of them she's good friends with but the other she doesn't talk to nearly as much as me, and I think she sometimes get annoyed by him too. So I am slightly hurt/offended by her not telling me the secret she has while telling some other people who I think one of them isn't as good of friends to her compared to me. I also asked the two other people, and they said that they don't think it's that big of a secret (and are only keeping it a secret because Candice wants to) and has something to do with science and college. So, am I the a\\*\\*hole for being offended/slightly angry at her for not telling me? I know we're just friends, but I'd think she would at least tell me something that apparently isn't that big of a deal.", "label_scores": {"YTA": 2, "NTA": 0, "ESH": 0, "NAH": 1, "INFO": 0}, "label": "YTA"}
{"id": "vbhcftBIo9bnQxP05IX40U89U5VXDEZI", "post_id": "9x563k", "post_type": "WIBTA", "title": "WIBTA if a stop dating a girl because of her trashy family?", "text": "  I have a crush that has been dating me for a few months, she is an incredible person, but her family is not that much. I hate all the members I know of her family, The reason? when I went to her house I heard them insulting me, I was in the living room and they were in the kitchen, talking about my appearance, and my way of talking, and to make matters worse, when they came back I realized that they did not know the acoustics of the house, because they thought I din't heard anything, and came to treat me well, in a false way, my crush was so ashamed tha she din't say nothing, and when i left home she texted me apologizing. \n  Days later her father sent me a giant text on facebook about how he would beat me if I hurt her daughter, and at the same day her sister texted me saying she did not like me, but she would accept me(they really thought that it was okay to send that to me).\n  The think is, we both teenagers, and if I'm going to have a more serious relationship with her I know I'll have to see her family again, i have anger problems, and I get anxious just to think about meeting her family, and I do not think I like my crush enough relieve that, but she's a awesome person, she makes me really happy. Would i be an asshole if I stopped dating her because of her family? What can i do?", "label_scores": {"YTA": 0, "NTA": 19, "ESH": 0, "NAH": 0, "INFO": 0}, "label": "NTA"}
{"id": "JgjXg7u1rXusGiWEhWLzhmB9rHUoVq2U", "post_id": "an8zfn", "post_type": "AITA", "title": "AITA for \"harassing\" this poor girl?", "text": "Oh boy, where to begin?\n\nSo, a couple of years ago, I developed a crush on this girl we'll call J. Now, things were going fine for a while, J liked me back too, so....what happened?\n\nFrankly, I had no idea.\n\nOne day, she came to school pissed. I asked here why she was angry. She wouldn't say, but I had a suspicion to why she would say this. see, the day before, we had a political discussion. We all had to give our opinion and respectfully debate with our peers. Now, I'm a hard Republican(trump, border wall, Right views)while she's a hard Democrat( patriarchy, feminist, fat acceptance, left views). This wasn't a problem until the debate, which, despite the main rule about keeping things civil, got a little heated, especially between me and her.\n\nSo jump back to the day she came to school pissed. I asked her why. She didn't respond. Now, this kept on for a MONTH. Finally, I grew a pair and decided to joke around with her. One day, when she was particularly angry, I said the following.\n\n\"Why are you so mad? Is it your time of the month?\"\n\nLet the chaos ensue.\n\nFrom that day on, she despised the ground I walked on. She would do the following\n\n- try to get me in trouble for any goddamn reason, she even lied about many things. EX: reported me for saying the N word on the day I was sick with the flu.\n\n-succesfully turned all my friends against me for a year, using the excuse that I was \"homophobic, racist, sexist etc.\" Which I am not. Disagreeing with someone over the border wall does not make me racist\n\n- got angry over the tiniest things. \nEX 1:threw a hissy fit because I took \"her\" seat on the bus(no assigned seats.) I offered to move, but she just gave me the death glare and sat somewhere else.\n\nEX 2: yelled at me because my friend left his banana peel on the table. She told me that he was my responsibility or whatever. I told her to take her complaints with him.\n\nSo much shit has happened with her, to the point where other people just don't like hanging out with her anymore. She keeps saying shit like \"Oh, finally, the people I actually care about \" to her friends. She insults them and disregards them on a day to day basis. Now, with all this happening, I apologized about the \"time of the month\" comment. three times. She didn't care. She was in it for the drama at this point. She loved drama.\n\nYou know how I know?\n\nAll of this shit happened 2-3 years ago. All of it. And she keeps bringing it up. She uses it as an excuse! She constantly brings up irrelevant shit and causes controversy just to see a bit of drama! I'm sick and tired of her,but I wonder? AITA? I don't know? Could you guys help me decide?", "label_scores": {"YTA": 1, "NTA": 3, "ESH": 5, "NAH": 0, "INFO": 1}, "label": "ESH"}
{"id": "uo2KlgTbzEE64XECKuSxZAvVJ7h3tjDZ", "post_id": "acnpcs", "post_type": "WIBTA", "title": "WIBTA if I went out to lunch with an old acquaintance and used a gift card to pay for myself but didn’t offer to pay for theirs even though they know I was just gifted a large amount on the gift card?", "text": "I’m going to dinner with a close friend, X, who is still very close to someone who I would no longer consider a friend, but an old acquaintance, Z. Now X is kind of trying to revive my friendship with Z and suggested we all get dinner sometime because they know I just got a gift card to our formerly favorite restaurant to go to as a group. Z offered to smoke us out before eating (maybe as a reciprocation for using the gift card? I can’t really be sure), but I haven’t been smoking recently, so I declined the offer and instead just opted to meet them at the restaurant. WIBTA if I chose to use the gift card just to pay for my meal and didn’t offer it for theirs?\n\nTl;dr acquaintance offered to smoke me out (maybe? Idk how these social cues work) in exchange for using my gift card at a restaurant together, but I don’t smoke. Can I just use the gift card on myself?", "label_scores": {"YTA": 0, "NTA": 8, "ESH": 0, "NAH": 0, "INFO": 0}, "label": "NTA"}
